package dev.filinhat.bikecalc.domain.enums.tire

/**
 * Список размеров для 24-х дюймовых колес велосипеда.
 */
enum class TireSize24Inches(
    override val nameSize: String,
    override val tireWidthInInches: Double,
    override val tireWidthInMillimeters: Double,
) : TireSize {
    Size24x075("24 x 0.75 (20 - 540)", 0.75, 16.0),
    Size24x090("24 x 0.90 (23 - 520)", 0.90, 16.5),
    Size24x090x("24 x 0.90 (23 - 540)", 0.90, 16.5),
    Size24x100("24 x 1.00 (25 - 540)", 1.00, 19.0),
    Size24x120("24 x 1.20 (30 - 540)", 1.20, 30.0),
    Size24x150("24 x 1.50 (40 - 507)", 1.50, 40.0),
    Size24x175("24 x 1.75 (47 - 507)", 1.75, 47.0),
    Size24x195("24 x 1.95 (50 - 507)", 1.95, 49.5),
    Size24x200("24 x 2.00 (50 - 507)", 2.00, 51.0),
    Size24x210("24 x 2.10 (54 - 507)", 2.10, 53.34),
    Size24x215("24 x 2.15 (55 - 507)", 2.15, 54.61),
    Size24x220("24 x 2.20 (57 - 507)", 2.20, 55.88),
    Size24x225("24 x 2.25 (60 - 507)", 2.25, 57.15),
    Size24x230("24 x 2.30 (60 - 507)", 2.30, 58.42),
    Size24x235("24 x 2.35 (60 - 507)", 2.35, 59.69),
    Size24x240("24 x 2.40 (61 - 507)", 2.40, 61.0),
    Size24x250("24 x 2.50 (63 - 507)", 2.50, 63.50),
    Size24x300("24 x 3.00 (76 - 507)", 3.00, 76.2),
    Size24x350("24 x 3.50 (89 - 507)", 3.50, 88.9),
    Size24x400("24 x 4.00 (102 - 507)", 4.00, 101.6),
    Size24x450("24 x 4.50 (114 - 507)", 4.50, 114.3),
    Size24x500("24 x 5.00 (127 - 507)", 5.00, 127.0),
}
